In [1]:
import pandas as pd
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
dataframe = pd.read_csv(url)

In [5]:
dataframe.sample(5)

                              Name PClass   Age     Sex  Survived  SexCode
120   Gracie, Colonel Archibald IV    1st  54.0    male         1        0
1309        Zakarian, Mr Maprieder    3rd  26.0    male         0        0
694             Burke, Mr Jeremiah    3rd  19.0    male         0        0
338     Becker, Miss Marion Louise    2nd   4.0  female         1        1
1044         Murphy, Miss Margaret    3rd   NaN  female         0        1

In [6]:
dataframe.head(3)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [7]:
dataframe.tail(3)

                  Name PClass   Age   Sex  Survived  SexCode
1310  Zenni, Mr Philip    3rd  22.0  male         0        0
1311  Lievens, Mr Rene    3rd  24.0  male         0        0
1312    Zimmerman, Leo    3rd  29.0  male         0        0

# Check the dimensions of the dataframe

In [14]:
dataframe.shape

(1313, 6)

# Describe statistics of numeric columns

In [12]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

# Counts empty values

In [11]:
dataframe.isnull().sum()

Name          0
PClass        0
Age         557
Sex           0
Survived      0
SexCode       0
dtype: int64

# Saving dataframe

In [18]:
dataframe.to_csv('saved.csv')
dataframe.to_json('saved.json')

# Creating a dataframe from json dictionary

In [20]:
nme = ['diego', 'julio', 'luiz', 'henry']
deg = ['ing', 'msc', 'mba', 'bca']
scr = [90, 40, 80, 98]
dict = {'name': nme, 'deg': deg, 'score': scr}
df = pd.DataFrame(dict)

In [21]:
df.sample(4)

    name  deg  score
2   luiz  mba     80
0  diego  ing     90
3  henry  bca     98
1  julio  msc     40

In [22]:
df.to_csv('file1.csv')